{
  "architectures": [
    "RWKVQwen3MoeForCausalLM"
  ],
  "description": "Hybrid-RWKV Strategically Interleaved RWKV-Attention for Efficient MoE Transformers",
  "base_model": "Qwen/Qwen3-30B-A3B-Instruct-2507",
  "model_revision": "stage1=170Mtk,stage2=590Mtk,3e-6annealed,mi300x",
  "transformer_layers": [5,11,17,23,29,35,41,47],
  "rwkv_layers": [0,1,2,3,4,6,7,8,9,10,12,13,14,15,16,18,19,20,21,22,24,25,26,27,28,30,31,32,33,34,36,37,38,39,40,42,43,44,45,46],
  "rwkv_architecture": "hxa079",
  "enable_qk_norm": true,
  "nope_in_transformer": true,
  "nope_in_rwkv": false,
  "weight_dtype": "bfloat16",
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "decoder_sparse_step": 1,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "max_position_embeddings": 32768,
  "max_window_layers": 48,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 768,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_key_value_heads": 4,
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 48,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000000,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}