{
  "architectures": [
    "RWKV079Qwen3ForCausalLM"
  ],
  "auto_map": {
      "AutoConfig": "configuration_rwkv079qwen3.RWKV079Qwen3Config",
      "AutoModelForCausalLM": "modeling_rwkv079qwen3.RWKV079Qwen3ForCausalLM"
  },
  "description": "Hybrid-RWKV Strategically Interleaved RWKV-Attention",
  "base_model": "ByteDance-Seed/Seed-OSS-36B-Instruct",
  "model_revision": "alpha",
  "transformer_layers":[6,13,20,27,33,39,45,51,57,63],
  "rwkv_layers": [0,1,2,3,4,5,7,8,9,10,11,12,14,15,16,17,18,19,21,22,23,24,25,26,28,29,30,31,32,34,35,36,37,38,40,41,42,43,44,46,47,48,49,50,52,53,54,55,56,58,59,60,61,62],
  "rwkv_architecture": "hxa07a",
  "enable_qk_norm": false,
  "nope_in_transformer": true,
  "nope_in_rwkv": false,
  "lora_rank_decay": 32,
  "lora_rank_iclr":16,
  "lora_rank_gate":64,
  "use_rope":true,



  "attention_bias": true,
  "attention_dropout": 0.1,
  "attention_out_bias": false,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 27648,
  "max_position_embeddings": 524288,
  "mlp_bias": false,
  "model_type": "rwkv079qwen3",
  "num_attention_heads": 80,
  "num_hidden_layers": 64,
  "num_key_value_heads": 8,
  "residual_dropout": 0.1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "rope_type": "default"
  },
  "rope_theta": 10000000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.0",
  "use_cache": true,
  "vocab_size": 155136
}