{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "classifier_dropout": 0.0,
  "eos_token_id": 100257,
  "head_dim": 96,
  "hidden_act": "silu",
  "hidden_size": 6144,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.006,
  "intermediate_size": 19648,
  "label2id": {
    "LABEL_0": 0
  },
  "max_position_embeddings": 98304,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 64,
  "num_hidden_layers": 44,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 8000000,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.50.3",
  "use_cache": true,
  "vocab_size": 100352
}
